{
  "meta.resume.title": "Curriculum Vitae - Mateusz Lesiak",
  "meta.portfolio.title": "Portfolio - Mateusz Lesiak",
  "meta.web.title": "Mateusz Lesiak - Inżynier oprogramowania",
  "meta.web.description": "Jestem inżynierem oprogramowania, który specjalizuje się w budowaniu (i czasami projektowaniu) stron oraz aplikacji internetowych wysokiej jakości wykorzystując React w jzyku TypeScript.",
  "about.title": "O mnie",
  "button.menu.toggle": "Rozwiń/Zwiń menu",
  "contact.btn": "Zobacz CV",
  "btn.viewSystem": "Zobacz projekt",
  "contact.title": "Kontakt",
  "footer.createdWith": "Stworzone w",
  "footer.designedIn": "Zaprojektowane w",
  "footer.viewRepository": "Przejdź do repozytorium",
  "header.logo": "Logo strony Mateusz Lesiak",
  "author": "Mateusz Lesiak",
  "homepage.btn": "Zobacz CV",
  "homepage.introduction": "Cześć, jestem",
  "icon.adobeXd": "Adobe XD",
  "icon.githubFork": "Ikona rozgałęzienia dla repozytorium z GitHub",
  "icon.githubStar": "Ikona gwiazdy dla repozytorium z GitHub",
  "icon.reactJs": "React.Js",
  "icon.typeScript": "TypeScript",
  "lang.en": "English",
  "lang.pl": "Polski",
  "lang.ru": "Русский",
  "navigation.home": "Start",
  "navigation.aboutMe": "O mnie",
  "navigation.contact": "Kontakt",
  "navigation.portfolio": "Portfolio",
  "navigation.resume": "Zobacz CV",
  "notFound.title": "Nie znaleziono strony",
  "notFound.btn": "Wróć na stronę główną",
  "portfolio.title": "Portfolio",
  "portfolio.description": "Portfolio",
  "resume.btn": "Pobierz w PDF",
  "resume.description": "Jestem inżynierem oprogramowania, który specjalizuje się w budowaniu (i czasami projektowaniu) stron oraz aplikacji internetowych wysokiej jakości. Uwielbiam poznawać nowe języki programowania i nieustannie rozwijać się w już obecnie znanych takich jak JavaScript czy TypeScript. W wolnych chwilach lubię chodzić na siłownię oraz gotować.",
  "resume.title": "Moje CV",
  "resume.section.education": "Edukacja",
  "resume.section.jobs": "Doświadczenie",
  "resume.section.projects": "Projekty",
  "resume.education.engineer.school": "Politechnika Łódzka",
  "resume.education.engineer.subtitle": "Informatyka, WFTIMS, stacjonarne, inżynierskie<br/>2016 - 2019, ocena z pracy dypl.: 5.0",
  "resume.education.engineer.text": "Temat pracy dypl. inż. to: „System do generowania oraz ewaluacji projektów stron internetowych”. System stworzony na potrzeby pracy dyplomowej inżynierskiej został napisany wykorzystując <strong>PostgreSQL, Spring Boot oraz React.js wraz z biblioteką Redux</strong>. Praca została oceniona i obroniona na 5.0 oraz <strong>uzyskałem stopień inżyniera 3 miesiące przed terminem zakończenia studiów</strong> stacjonarnych inż. I stopnia.",
  "resume.education.bachelor.school": "Politechnika Warszawska",
  "resume.education.bachelor.subtitle": "Informatyka Stosowana, WE, zaoczne, magisterskie<br/>2020 - obecnie",
  "resume.education.bachelor.text": "Specjalność: Inżynieria oprogramowania",
  "resume.jobs.appstract.position": "JavaScript/TypeScript Developer",
  "resume.jobs.appstract.subtitle": "01.2020 – obecnie, Appstract Software",
  "resume.jobs.appstract.text": "<ul><li>Programuję strony internetowe wraz z aplikacjami PWA wykorzystując bibliotekę React w warstwie serwerowej, głównie w języku TypeScript. Strony te są dostępne w zasięgu ogólnoświatowym, odwiedzane dziennie przez setki tysięcy osób.</li><li>Wykorzystując platformę Amazon AWS, utworzyłem wiele rozwiązań serverless; wdrażałem oraz konfigurowałem wszelkie potrzebne parametry do szybkiego działania strony internetowej.</li><li>Utworzyłem aplikację zintegrowaną z REST API Azure dla tejże platformy.</li><li>Wraz z zespołem utworzyłem aplikację mobilną wykorzystując React Native.</li><li>Prowadzę kilka projektów w tych technologiach.</li></ul>",
  "resume.jobs.cmi.position": "Referent",
  "resume.jobs.cmi.subtitle": "01.2019 – 12.2019, Politechnika Łódzka",
  "resume.jobs.cmi.text": "Pomimo stanowiska Referent zgodnie z&nbsp;umową, pracowałem jako <strong>Full Stack Developer/Administrator</strong> w&nbsp;projekcie ministerstwa „Centrum Mistrzostwa Informatycznego” realizowanego przez Politechnikę Łódzką oraz cztery inne partnerskie uczelnie.<ul><li>Opracowałem projekt responsywnej strony internetowej w&nbsp;Adobe XD, a&nbsp;następnie utworzyłem <strong>motyw zgodny z WCAG 2.0 AAA</strong> w&nbsp;technologiach PHP, JS, SCSS oraz Mustache.</li><li>Zarządzałem platformą Moodle dla projektu CMI, gdzie <strong>tygodniowo osiągane jest 100,000 wejść na stronę.</strong></li></ul>",
  "resume.jobs.celpl.position": "Full-Stack Web Developer",
  "resume.jobs.celpl.subtitle": "03.2018 – 01.2019, Centrum E-learningu Politechniki Łódzkiej",
  "resume.jobs.celpl.text": "<ul><li>Stworzyłem <strong>w&nbsp;pełni zautomatyzowany system w&nbsp;PHP oraz JS, który pozwala na zarządzanie rezerwacjami sal</strong> Politechniki Łódzkiej. Ponadto system wykorzystuje REST API ClickMeeting do skonfigurowania pokoi webinariowych dla pracowników PŁ.</li><li>Zrealizowałem mechanizm, który synchronizuje ustawienia 16&nbsp;portali WIKAMP Politechniki Łódzkiej poprzez API.</li><li>Utworzyłem nowy wygląd profilu użytkownika oraz opracowałem edytor konsultacji i&nbsp;publikacji w&nbsp;PHP, JS, Mustache.</li></ul>",
  "resume.jobs.wordpress.position": "Freelancer WordPress",
  "resume.jobs.wordpress.subtitle": "02.2017 – 09.2018, Samozatrudnienie",
  "resume.jobs.wordpress.text": "Na początku swojej kariery programistycznej tworzyłem projekty stron internetowych, a&nbsp;następnie <strong>motywy dla CMS WordPress</strong> dla ponad dziesięciu okolicznych przedsiębiorstw w&nbsp;<strong>technologiach PHP, JS, HTML5, SCSS</strong> wykorzystując <strong>Bootstrap.</strong>",
  "resume.projects.idemia.name": "System do zarządzania delegacjami",
  "resume.projects.idemia.subtitle": "03.2019 – 07.2019, Idemia",
  "resume.projects.idemia.text": "Wspólnie z&nbsp;grupą, na potrzeby przedmiotu Implementacje Przemysłowe 2019, zrealizowaliśmy system do zarządzania delegacjami wykorzystując <strong>Spring Boot jako aplikację warstwy logiki, React.JS, Redux</strong> do zaimplementowania <strong>strony internetowej</strong> oraz <strong>React Native</strong> do utworzenia <strong>aplikacji mobilnej</strong>. Byłem odpowiedzialny za implementację interfejsu użytkownika strony oraz aplikacji. System wdrażano wykorzystując konteneryzację (<strong>Docker</strong>) dzięki <strong>CI/CD</strong>.",
  "resume.projects.ssbd.name": "System do zamawiania i zarządzania wycieczkami Adventum",
  "resume.projects.ssbd.subtitle": "03.2019 – 07.2019, Politechnika Łódzka",
  "resume.projects.ssbd.text": "Wspólnie z&nbsp;grupą, na potrzeby przedmiotu Sieciowe systemy baz danych 2019, zrealizowaliśmy system do zamawiania oraz zarządzania wycieczkami Adventum. System został utworzony w&nbsp;architekturze trójwarstwowej, gdzie <strong>warstwa logiki została zrealizowana wykorzystując Javę EE, za to warstwa widoku została zrealizowana w&nbsp;React.js.</strong> Za warstwę danych odpowiada PostgreSQL. System został uruchomiony na serwerze Payara.",
  "theme.change": "Zmień motyw",
  "description": "Jestem inżynierem oprogramowania z Łodzi, który specjalizuje się w budowaniu (i czasami projektowaniu) stron oraz aplikacji internetowych wysokiej jakości",
  "fullname": "Mateusz Lesiak",
  "getInTouch": "Bądźmy w kontakcie",
  "goToGoogleMaps": "Przejdź do Map Google",
  "home": "Łódź, Polska",
  "pageInBuilding": "Strona w budowie",
  "viewLinkedIn": "Zobacz mój LinkedIn"
}
